# SQL

**Learning Objectives**: Learn how to connect to and query SQL databases and get the results back as Pandas DataFrames.

In [1]:
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

## Introduction

[SQL](http://en.wikipedia.org/wiki/SQL), or *Structured Query Lanauge* is a programming language focused on read, writing and transforming table based data sets, called *Relational Databases*. There are a number of reasons you might want to work with data in a SQL database:

* They offer high performance for a limited set of operations. They are much faster than Pandas for many types of operations, but are more limited.
* They can handle data sets that don't fit into memory. Pandas DataFrames have to fit in the memory of your computer, which limits their size. Data bases are typically stored on disk and don't have that limitation. This opens the door for working with much larger data sets. Most "big data" tools offer some sort of SQL interfaces.
* The data you want/need to work with may already be in a SQL database.


There are numerous free and open source databases that offer SQL interfaces:

* [SQLite](http://www.sqlite.org/)
* [MySQL](http://www.mysql.com/)
* [PostgreSQL](http://www.postgresql.org/)

It is a good idea to start with SQLite as it has good performance characteristics, doesn't require any specialized setup and comes already installed with Python.

There are a number of different Python packages for working with SQL databases:

* [SqlAlchemy](http://www.sqlalchemy.org/): foundation layer that other tools rely on.
* [pandas.io.sql](http://pandas.pydata.org/pandas-docs/stable/io.html#io-sql)
* [Blaze](http://blaze.pydata.org/docs/latest/index.html)

## Connecting

The first step in working with an existing SQL database is to connect to it. This involves figuring out the appropriate connection string and passing it to `sqlalchemy.create_engine`. Here is the logic for our SQLite database:

In [2]:
from sqlalchemy import create_engine

In [3]:
!rm titanic.db

rm: cannot remove ‘titanic.db’: No such file or directory

In [4]:
te = create_engine('sqlite:////datitanic.db')

Notice, this will use the file `titanic.db` in the current directory, which doesn't yet exist. SqlAlchemy will create it when needed. Here is the SqlAlchemy documentation for [engines and connection strings](http://docs.sqlalchemy.org/en/rel_0_9/core/engines.html).

## `pandas.io.sql`

Pandas has basic capabilties to reading, writing and querying SQL databases. These function are in the `pandas.io.sql` subpackage:

In [ ]:
from pandas.io import sql

In [ ]:
tdf = sns.load_dataset('titanic')

In [ ]:
tdf.head()

You can write a table to a SQL database using the `to_sql` method, which takes the name of the table and an engine object:

In [ ]:
tdf.to_sql('people', te)

In [ ]:
ls *.db

Now that we have a populated database table, we can use Pandas to query the data set. The first thing we might want to do is read the entire table back into Python as a `DataFrame`. To emphasize that this is a new object, let's delete the original `DataFrame` we had.

In [ ]:
del tdf

Then use the `read_sql_table` function with the table name and engine object to get the entire table:

In [ ]:
new_tdf = sql.read_sql_table('people', te)

In [ ]:
new_tdf.head()

Warning: don't do this unless you know exactly how large the table is. Databases can contain tables that are many times larger than the available memory on your system.

The real power of SQL databases comes from being able to query them using the SQL language. This can be done in Pandas using the `read_sql_query` function. To use this function, we need to cover the basic syntax of the SQL language. Here is a [high-level overview](http://www.w3schools.com/sql/default.asp) of the SQL language.

### SELECT

The `SELECT` statement is the most important part of the SQL language and is used to reads rows from a database table or tables. Here is an example that reads all (`*`) rows from the `people` table:

In [ ]:
sql.read_sql_query('SELECT * FROM people;', te).head()

You can read particular columns by name as follows:

In [ ]:
sql.read_sql_query('SELECT survived, sex, age, fare FROM people;', te).head()

### LIMIT

You can use the `LIMIT` clause to limit the number of rows that are returned. This is much more efficient that reading all  rows and then using `.head()`.

In [ ]:
sql.read_sql_query("""
SELECT survived, sex, age, fare
  FROM people
 LIMIT 10;
""", te)

### WHERE

You can use the `WHERE` clause to pick a subset of rows that satisfy certain criteria or tests. Notice how the notation for these tests is sligthly different from Python and Pandas.

In [ ]:
sql.read_sql_query("""
SELECT survived, sex, age, fare
  FROM people
 WHERE age>20 AND survived=0 and sex="male";
""", te).head()

### ORDER BY

You can sort the resulting rows using the `ORDER BY` clause and the name of a column or columns

In [ ]:
sql.read_sql_query("""
SELECT survived, sex, age, fare
  FROM people
 WHERE age>20 AND survived=0 and sex="male"
 ORDER BY fare;
""", te).head()

Add `DESC` to reverse the order of the sort to descending:

In [ ]:
sql.read_sql_query("""
SELECT survived, sex, age, fare
  FROM people
 WHERE age>20 AND survived=0 and sex="male"
 ORDER BY fare, age DESC;
""", te).head(10)

### SQL functions

SQL offers a host of functions that can applied to columns of data:

* `AVG()`
* `COUNT()`
* `MIN()`
* `MAX()`
* `SUM()`

Here we compute the number of males and the average fare they paid:

In [ ]:
sql.read_sql_query("""
SELECT AVG(fare), COUNT(sex)
  FROM people
 WHERE sex="male";
""", te)

In [ ]:
filtered = new_tdf[new_tdf.sex=='male']
pd.DataFrame({'COUNT(sex)': [filtered.sex.count()], 'AVG(fare)': [filtered.fare.mean()]})

### GROUP BY

The `GROUP BY` clause allows you to perform split-apply-combine to a table to perform a wide range of transformations and aggregations. This works almost identically to the `groupby` method in Pandas. Here we using `GROUP BY` to compute averarge fares by gender:

In [ ]:
sql.read_sql_query("""
SELECT sex, AVG(fare)
  FROM people
 GROUP BY sex
""", te)

Here is the same computation on a Pandas `DataFrame`:

In [ ]:
new_tdf.groupby('sex')['fare'].mean()

## Database introspection

One of the most important things to do when you start exploring a new database is to survey what tables the database has and what columns those tables have. This is simple with `sqlalchemy.inspect` and Pandas.

For this part, we will use the [Chinook Database](https://chinookdatabase.codeplex.com/) of music:

In [ ]:
ce = create_engine('sqlite:///data/Chinook_Sqlite.sqlite')

Create an inspector for that database:

In [ ]:
from sqlalchemy import inspect
inspector = inspect(ce)

Get the column names from the database:

In [ ]:
inspector.get_table_names()

Get the columns from a particular table:

In [ ]:
inspector.get_columns('Artist')

Here is a simple function for retrieving the the columns names and types as a `DataFrame`:

In [ ]:
def table_info(table_name, i):
    """Shwo the column names and types as a Pandas DataFrame."""
    return pd.DataFrame(i.get_columns(table_name))[['name','type']]

The `Album` table:

In [ ]:
table_info('Album', inspector)

The `Artist` table:

In [ ]:
table_info('Artist', inspector)

## Joining tables

Notice how both the `Artist` and `Album` table have an `ArtistId` column. Let's perform a join on those two tables. Similar to Pandas, SQL support 4 types of joins (INNER, LEFT, RIGHT, FULL). Notice how we are using AS to rename columns in the final result.

In [ ]:
sql.read_sql_query("""
SELECT Album.Title AS AlbumTitle, Artist.Name AS Artist FROM Album
    INNER JOIN Artist
    ON Artist.ArtistId=Album.ArtistId
    ORDER BY Artist.Name;
""", ce)